_posts/2015-11-27-plyr-for-expressive-idiomatic-r-code.html
---
date: 2015-11-27
tags: 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- 
- dummy-tags-should-be-replaced
author: 
layout: post
title: Using plyr for expressive, idiomatic R code
excerpt: A long-time skeptic comes around to actually liking plyr.
categories: 
- R
- computing
featured: false
---
<p>
When I first encountered the <i>plyr</i> package for R, I thought it was
needless frippery. There was nothing that a well-written loop or
subset couldn't do. Then I read Hadley Wickham's <a href="http://www.jstatsoft.org/article/view/v040i01/v40i01.pdf">Split-Apply-Combine</a>
paper, taught <i>plyr</i> as a TA, and tried it out in my own code. I've
been converted, it's a great tool for expressive R code.
</p>

<div id="outline-container-orgfea4866" class="outline-2">
<h2 id="orgfea4866">A simple example</h2>
<div class="outline-text-2" id="text-orgfea4866">
<p>
It's best to see this by example. For my ADA work I'm working with
power spectra from a large number of recordings of neural activity
in mice brains. When I'm doing my analysis the first part of my code
is loading the data. My first approach is below.
</p>

<div class="org-src-container">
<pre class="src src-R">dfs <span style="color: #96CBFE;">&lt;-</span> list()

<span style="color: #4c83ff;">for</span>(ii <span style="color: #4c83ff;">in</span> seq_along(files)) {
    file <span style="color: #96CBFE;">&lt;-</span> files[ii]
    mouse <span style="color: #96CBFE;">&lt;-</span> mice[ii]
    label <span style="color: #96CBFE;">&lt;-</span> labels[ii]

    dfs[[ii]] <span style="color: #96CBFE;">&lt;-</span> cbind(read_spectrum(file), mouse = mouse, label = label)
}

df <span style="color: #96CBFE;">&lt;-</span> do.call(rbind, dfs)
</pre>
</div>

<p>
This is a fairly straightforward approach. I pass a list of
filenames, mouse identifiers, and disease labels (using the
wonderful <a href="https://github.com/trevorld/argparse">argparse</a> package) and load the spectra as dataframes which
I eventually <i>rbind</i> together.
</p>

<p>
Here's the corresponding <i>plyr</i> version
</p>

<div class="org-src-container">
<pre class="src src-R">inputs <span style="color: #96CBFE;">&lt;-</span> data.frame(file = files, mouse = mice, label = labels)

df <span style="color: #96CBFE;">&lt;-</span> mdply(inputs, <span style="color: #4c83ff;">function</span>(file, mouse, label) {
    <span style="color: #4c83ff;">return</span>(cbind(read_spectrum(file), mouse = mouse, label = label))
})
</pre>
</div>

<p>
Looking at this code, it's more compact at 5 lines compared to 11
for the for loop.
</p>
</div>
</div>

<div id="outline-container-org85b28d1" class="outline-2">
<h2 id="org85b28d1">A more complicated example</h2>
<div class="outline-text-2" id="text-org85b28d1">
<p>
Now, once I've loaded the spectra as a dataframe, I need to
aggregate them, first within mice, and then between label.
</p>

<p>
The resulting R code is a little messy.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #ff1493;">average_specs</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>(df) {
    freqs <span style="color: #96CBFE;">&lt;-</span> unique(df$frequency)
    avepower <span style="color: #96CBFE;">&lt;-</span> rep(<span style="color: #afd8af;">NA</span>, length(freqs))

    <span style="color: #4c83ff;">for</span>(ii <span style="color: #4c83ff;">in</span> seq_along(freqs)) {
        freq <span style="color: #96CBFE;">&lt;-</span> freqs[ii]
        nRecordings <span style="color: #96CBFE;">&lt;-</span> nrow(df) / length(freqs)
        avepower[ii] <span style="color: #96CBFE;">&lt;-</span> sum(df$power[df$frequency == freq]) / nRecordings
    }

    data.frame(frequency = freqs, power = avepower)

    <span style="color: #4c83ff;">return</span>(df)
}

<span style="color: #8B8989; font-style: italic;">## </span><span style="color: #8B8989; font-style: italic;">Aggregate by mouse</span>
micedfs <span style="color: #96CBFE;">&lt;-</span> list()
uniqMice <span style="color: #96CBFE;">&lt;-</span> unique(mice)
<span style="color: #4c83ff;">for</span>(ii <span style="color: #4c83ff;">in</span> seq_along(uniqMice)) {
    mouse <span style="color: #96CBFE;">&lt;-</span> uniqMice[ii]
    label <span style="color: #96CBFE;">&lt;-</span> df$label[df$mouse == mouse][1]

    mousedf <span style="color: #96CBFE;">&lt;-</span> averageSpecs(df[df$mouse == mouse])
    mousedf$label <span style="color: #96CBFE;">&lt;-</span> label
    micedfs[ii] <span style="color: #96CBFE;">&lt;-</span> mousedf
}

micedf <span style="color: #96CBFE;">&lt;-</span> do.call(rbind, micedfs)

<span style="color: #8B8989; font-style: italic;">## </span><span style="color: #8B8989; font-style: italic;">Aggregate by condition</span>
labeldfs <span style="color: #96CBFE;">&lt;-</span> list()
uniqLabels <span style="color: #96CBFE;">&lt;-</span> unique(labels)
<span style="color: #4c83ff;">for</span>(ii <span style="color: #4c83ff;">in</span> seq_along(uniqLabels)) {
    label <span style="color: #96CBFE;">&lt;-</span> uniqLabels[ii]

    labeldf <span style="color: #96CBFE;">&lt;-</span> averageSpecs(micedf[micedf$label == label])
    labeldf$label <span style="color: #96CBFE;">&lt;-</span> label
    labeldfs[ii] <span style="color: #96CBFE;">&lt;-</span> labeldf
}

df <span style="color: #96CBFE;">&lt;-</span> do.call(rbind, labeldfs)
</pre>
</div>

<p>
I don't want to talk about this. It's just ugly.
</p>

<p>
This was actually the example which lead to my <i>plyr</i> epiphany. Just
look at the <i>plyr</i> version.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #ff1493;">average_specs</span> <span style="color: #96CBFE;">&lt;-</span> <span style="color: #4c83ff;">function</span>(df) {
    df <span style="color: #96CBFE;">&lt;-</span> ddply(df, .(frequency), summarize, power <span style="color: #96CBFE;">&lt;-</span> mean(power))
    <span style="color: #4c83ff;">return</span>(df)
}

df <span style="color: #96CBFE;">&lt;-</span> ddply(specdf, .(label), <span style="color: #4c83ff;">function</span>(labelsub) {
    df <span style="color: #96CBFE;">&lt;-</span> ddply(specdf, .(mouse), <span style="color: #4c83ff;">function</span>(mousesub) {
        df <span style="color: #96CBFE;">&lt;-</span> average_specs(sub)
        <span style="color: #4c83ff;">return</span>(df)
    })
    <span style="color: #4c83ff;">return</span>(df)
})
</pre>
</div>

<p>
Wow, that just looks nice. It's concise with very little
boilerplate. I can easily extend it to calculate other summary
statistics such as standard deviations.
</p>
</div>
</div>

<div id="outline-container-org41c12e6" class="outline-2">
<h2 id="org41c12e6">Icing on the cake</h2>
<div class="outline-text-2" id="text-org41c12e6">
<p>
Now that I've gotten the summary statistics I like to plot them.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #4c83ff;">for</span>(label <span style="color: #4c83ff;">in</span> uniqLabels) {
    outfile <span style="color: #96CBFE;">&lt;-</span> paste0(outdir, <span style="color: #61CE3C;">"/"</span>, label, <span style="color: #61CE3C;">".pdf"</span>)

    select <span style="color: #96CBFE;">&lt;-</span> df$label == label
    subdf <span style="color: #96CBFE;">&lt;-</span> df[select, ]
    fig <span style="color: #96CBFE;">&lt;-</span> ggplot(subdf, aes(x = frequency, y = power)) + geom_line()
    ggsave(outfile, fig)
}
</pre>
</div>

<p>
The <i>plyr</i> version is very similar.
</p>

<div class="org-src-container">
<pre class="src src-R">d_ply(df, .(label), <span style="color: #4c83ff;">function</span>(df) {
    label <span style="color: #96CBFE;">&lt;-</span> df$label[1]
    outfile <span style="color: #96CBFE;">&lt;-</span> paste0(outdir, <span style="color: #61CE3C;">"/"</span>, label, <span style="color: #61CE3C;">".pdf"</span>)

    fig <span style="color: #96CBFE;">&lt;-</span> ggplot(df, aes(x = frequency, y = power)) + geom_line()
    ggsave(outfile, fig)
})
</pre>
</div>

<p>
That's nice, but not really that different. But what if I got data
from a several location in the brain and wanted to plot those
locations individually?
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #4c83ff;">for</span>(label <span style="color: #4c83ff;">in</span> uniqLabels) {
    <span style="color: #4c83ff;">for</span>(location <span style="color: #4c83ff;">in</span> uniqLocations) {
        select <span style="color: #96CBFE;">&lt;-</span> df$label == label &amp; df$location == location
        <span style="color: #4c83ff;">if</span>(any(select)) { <span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">avoid empty df error</span>
            outfile <span style="color: #96CBFE;">&lt;-</span> paste0(outdir, <span style="color: #61CE3C;">"/"</span>, label, <span style="color: #61CE3C;">"-"</span>, location, <span style="color: #61CE3C;">".pdf"</span>)

            subdf <span style="color: #96CBFE;">&lt;-</span> df[select, ]
            fig <span style="color: #96CBFE;">&lt;-</span> ggplot(subdf, aes(x = frequency, y = power)) + geom_line()
            ggsave(outfile, fig)
        }
    }
}
</pre>
</div>

<p>
I dislike the look of this. The first four lines are too long and
I'm already at three levels of indentation.
</p>

<p>
By contrast, <i>plyr</i> handles this very gracefully.
</p>

<div class="org-src-container">
<pre class="src src-R">d_ply(df, .(label, location), <span style="color: #4c83ff;">function</span>(df) {
    label <span style="color: #96CBFE;">&lt;-</span> df$label[1]
    location <span style="color: #96CBFE;">&lt;-</span> df$location[1]
    outfile <span style="color: #96CBFE;">&lt;-</span> paste0(outdir, <span style="color: #61CE3C;">"/"</span>, label, , <span style="color: #61CE3C;">"-"</span>, location, <span style="color: #61CE3C;">".pdf"</span>)

    fig <span style="color: #96CBFE;">&lt;-</span> ggplot(df, aes(x = frequency, y = power)) + geom_line()
    ggsave(outfile, fig)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fec862" class="outline-2">
<h2 id="org2fec862">Conclusion</h2>
<div class="outline-text-2" id="text-org2fec862">
<p>
Experimenting with <i>plyr</i> is a manifestation of my effort to write
more idiomatic R. Like the examples above, I find that most of the R
code that stands out to me as ugly is the result of failing to use
the correct R idiom. I haven't compared the speed of plyr. I assume
it would compare well enough, but that's somewhat beside the point.
Expressiveness and readability are the metrics that I'm trying to
optimize here.
</p>

<p>
A similar process occured with <i>ggplot2</i>. At first I thought it was
completely unnecessary. Now I feel pain at the thought of showing
people base R plots. The syntax is just so much easier and
expressive.
</p>

<p>
The common thread is that both packages are part of the
"Hadleyverse". I'll have to <a href="http://adolfoalvarez.cl/the-hitchhikers-guide-to-the-hadleyverse/">explore</a> further, <i>dplyr</i> and <i>tidyr</i>
seem like the logical next steps.
</p>

<p>
Oh, and just in case you're wondering, you can do some of the <a href="http://dataframesjl.readthedocs.org/en/latest/split_apply_combine.html">same
things</a> in <i>julia</i>.
</p>
</div>
</div>
